feat: add tests, fix assignee bug, update docs
